/* 
Κώστας Γουτούδης
gks ERP
www.gks.gr
*/

gks_big_text_nonObligatedRecipient_info_text=
  'Το πεδίο <b>Μη Υπόχρεος Λήπτης</b> παραστατικού διακίνησης είναι αποδεκτό μόνο για παραστατικά διακίνησης και όταν συμπληρώνεται, η ψηφιακή διαδικασία διακίνησης δεν απαιτεί την εμπλοκή του λήπτη για την ολοκλήρωση της';

gks_big_text_withoutDigitalTransportTracking_info_text=
  'Το πεδίο <b>Χωρίς Παρακολούθηση</b> (Χωρίς Ψηφιακή Παρακολούθηση Διακίνησης) είναι αποδεκτό μόνο για παραστατικά διακίνησης και όταν συμπληρώνεται, το παραστατικό διακίνησης δε συμμετέχει στη ψηφιακή διαδικασία διακίνησης και για αυτό η κατάσταση διακίνησης του μεταβαίνει με την έκδοση σε Competed';
  
        