/* 
Κώστας Γουτούδης
gks ERP
www.gks.gr
*/

gks_big_text_b2g_inv_aaht_name_info_text=
  '<p><b>Ένα αναγνωριστικό που αποδίδεται από τον Αγοραστή και ρησιμοποιείται για σκοπούς εσωτερικής δρομολόγησης.</b></p>' +
  '<p>Πεδίο ΔΡΟΜΟΛΟΓΗΣΗΣ. Το αναγνωριστικό αυτό ορίζεται από τον ' +
  'Αγοραστή (BT-44) ως μια <b>περιγραφή-όνομα</b> της <b>Αναθέτουσας Αρχής</b> ' +
  '(σύμφωνα με την υφιστάμενη ΚΥΑ ΜΟΡΦΟΤΥΠΟΥ) , αλλά παρέχεται στο ' +
  'Η.Τ από τον Πωλητή και αφορά στη περιγραφή οργανικής μονάδας στη ' +
  'διοικητική δομή του Αγοραστή (π.χ Νοσοκομείο ΕΥΑΓΓΕΛΙΣΜΟΣ, VII ' +
  'ΜΟΝΑΔΑ ΣΤΡΑΤΟΥ, ΔΟΥ Ιωαννίνων, Πανεπιστήμιο Αιγαίου) , η οποία ' +
  'έχει οριστεί ως <b>Αναθέτουσα Αρχή</b> και είναι ο λογιστικά υπεύθυνος για ' +
  'τη διαχείριση του Η.Τ. Στην παραπάνω περιγραφή, μη υποχρεωτικά και ' +
  'συμπληρωματικά παρέχεται (εάν υφίσταται) και μια περιγραφή ' +
  'εσωτερικής, διοικητικής μονάδας της συγκεκριμένης Αναθέτουσας Αρχής, ' +
  'στην οποία καταλήγει το Η.Τ, (π.χ ΦΑΡΜΑΚΕΙΟ, ΔΙΑΧΕΙΡΙΣΗ ' +
  'ΥΓΕΙΟΝΟΜΙΚΟΥ ΥΛΙΚΟΥ, ΤΕΧΝΙΚΗ ΥΠΗΡΕΣΙΑ, Στρατιωτικό Πρατήριο ' +
  'Αλεξανδρούπολης, κ.λ.π) , και η οποία δεν αποτελεί από μόνη της Α.Α, ή ' +
  'εναλλακτικά ενός αλφαριθμητικου ΚΩΔΙΚΟΥ.' +
  '</p><p>' +
  'Στην περίπτωση που o Αγοραστής/ΦΟΡΕΑΣ στο BT-44 (υποχρεωτικό ' +
  'πεδίο) και η Α.Α στο BT-10 (προαιρετικό πεδίο) είναι διαφορετικές ' +
  'οντότητες, το BT-10 δύναται να πάρει μια από τις εξής εναλλακτικές ' +
  'μορφές:</p>' +
  '<ul style="font-weight: bold;">' +
  '<li>BT-10 :: <Περιγραφή Α.Α><br>' +
  '-ή-</li>' +
  '<li>BT-10 :: <Περιγραφή Α.Α>“|”<Περιγραφή Εσωτερ. Μονάδας της Α.Α ' +
  'Παραλαβής του Η.Τ><br>' +
  '-ή-</li>' +
  '<li>BT-10 :: <Περιγραφή Α.Α>“|”<ΚΩΔΙΚΟΣ Α.Α ή ΚΩΔΙΚΟΣ Εσωτερ. ' +
  'Μονάδας της Α.Α Παραλαβής Η.Τ></li>' + 
  '<li>BT-44 :: <Περιγραφή Αγοραστή / Φορέα></li>' +
  '</ul>' +
  '<p>Στην περίπτωση που o Αγοραστής/ΦΟΡΕΑΣ στο BT-44 (υποχρεωτικό ' +
  'πεδίο) και η Α.Α στο BT-10 (προαιρετικό πεδίο) είναι <b>ταυτόσημες</b> ' +
  'οντότητες, το BT-10 δύναται να πάρει μια από τις εξής εναλλακτικές ' +
  'μορφές:</p>' +

  '<ul style="font-weight: bold;">' +
  '<li>BT-10 :: μπορεί να μην υφίσταται στο XML του Η.Τ, ως μη ' +
  'υποχρεωτικό πεδίο.<br> ' +
  '-ή-</li>' + 
  '<li>BT-10 :: <Περιγραφή Εσωτερ Μονάδας της Α.Α Παραλαβής του Η.Τ><br> ' +
  '-ή-</li>' + 
  '<li>BT-10 :: <Περιγραφή Εσωτερ Μονάδας της Α.Α Παραλαβής του Η.Τ> ' +
  '“|” <ΚΩΔΙΚΟΣ Α.Α ή ΚΩΔΙΚΟΣ Εσωτερ. Μονάδας της Α.Α Παραλαβής' + 
  'Η.Τ></li>' + 
  '<li>BT-44 :: <Περιγραφή Α.Α, ως Φορέας/Αγοραστής></li>' +
  '</ul>' +
  
  '<p>Η ανωτέρω κωδικοποίηση της εσωτερικής, οργανικής μονάδας του ' +
  '<b>Αγοραστή/Φορέας</b> (ο οποίος Αγοραστής ως Νομικό Πρόσωπο έχει δικό ' +
  'του ΑΦΜ και περιγράφεται στα πεδία <b>ΒΤ-44</b> και <b>ΒΤ-48</b>, π.χ Α.Α.Δ.Ε, ' +
  'Νοσοκομείο ΕΥΑΓΓΕΛΙΣΜΟΣ, Υπουργείο Μετανάστευσης, ΥΕΘΑ, ' +
  'Πανεπιστήμιο Αιγαίου), θα επιλέγεται από τον εκδότη του Η.Τ, κατόπιν ' +
  'συνεννοήσεως με τον Αγοραστή.' +
  '</p><p>' +
  'Το πρώτο μέρος του πεδίου <b>BT-10</b> συμπληρώνεται για τον προσδιορισμό με το όνομά της, εκείνης της Α.Α που είναι ' +
  '<b>λογιστικά υπεύθυνη</b> για το Ηλεκτρονικό Τιμολόγιο, δηλαδή της εσωτερικής υπηρεσιακής μονάδας του <b>Αγοραστή ' +
  '(ΒΤ-44)</b> που πραγματοποιεί την δαπάνη ή οποιαδήποτε υπηρεσιακή μονάδα στην οποία έχει από το νόμο ανατεθεί ' +
  'η αρμοδιότητα. Μπορεί επιπλέον να αναφέρεται σε ρόλο υπαλλήλου, όπως υπόλογος Χρηματικού Εντάλματος ' +
  'Προπληρωμής ή Διαχειριστή πάγιας προκαταβολής.' +
  '</p><p>' +
  'Το δεύτερο μέρος του πεδίου δεν είναι υποχρεωτικό να υφίσταται, εάν αντίστοιχη διοικητική μονάδα δεν ' +
  'προβλέπεται στο οργανόγραμμα της Α.Α. Ενδεικτικά παραδείγματα για το BT-10: <ΔΟΥ ΙΩΑΝΝΙΝΩΝ>, <Νοσοκ ' +
  'ΕΥΑΓΓΕΛΙΣΜΟΣ|ΦΑΡΜΑΚΕΙΟ>, <Νοσοκ ΕΥΑΓΓΕΛΙΣΜΟΣ|ΔΙΑΧΕΙΡΙΣΗ ΤΡΟΦΙΜΩΝ>, <ΥΠΟΥΡΓΕΙΟ ΜΕΤΑΝΑΣΤΕΥΣΗΣ ΚΑΙ ' +
  'ΑΣΥΛΟΥ|ΤΕΧΝΙΚΗ ΥΠΗΡΕΣΙΑ>, <VII ΜΟΝΑΔΑ ΣΤΡΑΤΟΥ|Στρατιωτικό Πρατήριο Αλεξανδρούπολης>, <Παν/μιο ' +
  'ΑΙΓΑΙΟΥ|ΣΧΟΛΗ ΘΕΤΙΚΩΝ ΕΠΙΣΤΗΜΩΝ στη ΣΑΜΟ>. Εκατέρωθεν του συμβόλου «Ι» δεν πρέπει να υπάρχουν κενοί ' +
  'χαρακτήρες. Η εξειδίκευση του τελικού παραλήπτη του Η.Τ εντός της Α.Α στο πεδίο BT-10 (δεύτερο συνθετικό), ' +
  'αποσκοπεί στη λογική ομαδοποίηση ή ανεύρεση Η.Τ ανά τελικό παραλήπτη (κατά την εμφάνιση και όχι μόνο) των ' +
  'Η.Τ στο χρήστη, εάν πολλαπλά Η.Τ καταλήγουν σε διαφορετικούς τελικούς αποδέκτες εντός της ίδιας Α.Α, η οποία ' +
  'αναφέρεται στο πρώτο συνθετικό του πεδίου BT-10. Παραδείγματα με χρήση ΚΩΔΙΚΟΥ: <Νοσοκ ' +
  'ΕΥΑΓΓΕΛΙΣΜΟΣ|XYZ123ABC>, <ΦΑΡΜΑΚΕΙΟ|MNP567OPQ> όταν ο Αγοραστής στο BT-44 είναι και Α.Α το Νοσοκ. ' +
  'ΕΥΑΓΓΕΛΙΣΜΟΣ.' +
  '</p><p>' +
  'Συστήνεται, η χρήση του πεδίου BT-10 κατά την υλοποίηση σε εφαρμογή, για ανεύρεση Η.Τ, να γίνεται με ' +
  'διαδικασία “Pattern matching” στη <b>Βάση Δεδομένων</b>, οπότε το SELECT query θα πρέπει να τροποποιηθεί ' +
  'κατάλληλα και αντί του τελεστή ισότητας = να χρησιμοποιείται ο τελεστής “<b>like</b>” με wild card. Με αυτή τη ' +
  'προϋπόθεση, η χρήση κατάλληλου secondary index στη βάση δεδομένων στο πεδίο BT-10 είναι αναμφισβήτητα ' +
  'απαραίτητη.' +
  '</p><p>' +
  'Στην ομάδα πεδίων <b>BG-13 (BT-70, BT-71)</b> συμπληρώνονται τα στοιχεία του φυσικού παραλήπτη των ' +
  'τιμολογηθέντων αγαθών – υπηρεσιών, ο οποίος είναι μια μονάδα εσωτερική της Α.Α (όπως αυτή ορίζεται από τα ' +
  'πεδία ΒΤ-10, ΒΤ-46), η οποία δύναται να είναι διαφορετική από την μονάδα παραλαβής/πληρωμής του Η.Τ και ' +
  'περιγράφεται, εάν υφίσταται, (ως δεύτερο συνθετικό) στο πεδίο BT-10. Ενδεικτικά BT-10 παραδείγματα: ' +
  '<Α.Α|ΦΑΡΜΑΚΑΠΟΘΗΚΗ>, <Α.Α|ΑΠΟΘΗΚΗ ΠΥΡΟΜΑΧΙΚΩΝ Β>, <Α.Α|ΚΥΛΙΚΕΙΟ>, <Α.Α|ΑΠΟΘΗΚΗ ΥΛΙΚΩΝ>, < ' + 
  'ΦΑΡΜΑΚΑΠΟΘΗΚΗ>, <ΑΠΟΘΗΚΗ ΠΥΡΟΜΑΧΙΚΩΝ Β|ΑΒΓΧΥΖ123>, <ΑΠΟΘΗΚΗ ΥΛΙΚΩΝ|12334567>.</p>';
  
gks_big_text_contract_reference_info_text=
  '<p><b>Η αναγνώριση μιας σύμβασης.</b></p>' +
  '<p>Πεδίο ΔΡΟΜΟΛΟΓΗΣΗΣ. Στο πεδίο συμπληρώνεται ο <b>Αριθμός ' +
  'Διαδικτυακής Ανάρτησης Μητρώου (ΑΔΑΜ) Σύμβασης</b> του ΚΗΜΔΗΣ. ' +
  'Εάν δεν υπάρχει γραπτή σύμβαση για <b>προμήθειες κάτω των 2.500€</b> ' +
  'μπαίνει η τιμή <b>«0|<ΑΔΑ Ανάληψης>»</b>, ανεξαρτήτως αν υπάρχει ' +
  'υποχρέωση ανάρτησης στο ΚΗΜΔΗΣ. ' +
  'Εάν σε κάθε περίπτωση, δεν είναι γνωστός ο ΑΔΑΜ, το πεδίο λαμβάνει την ' +
  'τιμή <b>0</b>' +
  '</p><p>' + 
  'Το πεδίο BT-12 συμπληρώνεται με τον <b>Αριθμό Διαδικτυακής Ανάρτησης Σύμβασης (ΑΔΑΜ) του Κεντρικού ' +
  'Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων (ΚΗΜΔΗΣ)</b>, σύμφωνα με το άρθρο 38 του Ν. 4412/2016 (Α.147). ' +
  'Όταν δεν υπάρχει ΑΔΑΜ συμπληρώνεται το πεδίο με τιμή τη συμβολοσειρά (character string) αποτελούμενη από 0 ' +
  'το χαρακτήρα pipeline «Ι» και τον Αριθμός ΑΔΑ Απόφασης Ανάληψης Υποχρέωσης εάν αρμόζει. Στη τελευταία ' +
  'περίπτωση, ο ΑΔΑ Ανάληψης στη συμβολοσειρά είναι ο ίδιος με τον ΑΔΑ Ανάληψης στο πεδίο BT-11.' +
  '</p><p>' + 
  'Στη περίπτωση κλασσικού (συσχετισμένου) Πιστωτικού Τιμολογίου, το πεδίο ΒΤ-12 συμπληρώνεται από τον Εκδότη ' +
  'του Η.Τ κατά τη συμπλήρωσή του, με τη τιμή ΜΗΔΕΝ (0). Στη περίπτωση αυτή, τα τρίτα συστήματα μετά το ΚΕ.Δ, ' +
  'που παραλαμβάνουν και επεξεργάζονται το Η.Τ, εφόσον χρειάζονται τον ΑΔΑΜ, θα αποκτήσουν ενδο-συστημικά ' +
  'τον ΑΔΑΜ του πρώτου, παλαιότερου συσχετισμένου χρεωστικού Η.Τ της ίδιας σύμβασης, με ID από το πεδίο BT-25 ' +
  'του τρέχοντος πιστωτικού Η.Τ (βλέπε και περιγραφή για το BT-25).' +
  '</p><p>' + 
  'Ο <b>ΑΔΑΜ</b> είναι ο <b>μοναδικός αριθμός</b> που λαμβάνει το έγγραφο της <b>σύμβασης</b> όταν αναρτηθεί στο σύστημα του ' +
  'Κεντρικού Ηλεκτρονικού Μητρώου Δημοσίων Συμβάσεων (ΚΗΜΔΗΣ) και είναι ο αριθμός που χαρακτηρίζει τη ' +
  'Σύμβαση. Εκτός κάποιων εξαιρέσεων, όλες οι συμβάσεις στις οποίες συμβαλλόμενος είναι φορέας του Δημοσίου ' +
  'αναρτώνται στο ΚΗΜΔΗΣ (δείτε περισσότερα: ν.4412/2016 αρθ. 38 και ΥΑ 57654/2017 ΦΕΚ Β\' 1781 ή ' +
  '<a href="http://www.eprocurement.gov.gr" target="_blank">http://www.eprocurement.gov.gr</a>). Αναζήτηση στοιχείων συμβάσεων ΚΗΜΔΗΣ: ' +
  '<a href="http://www.eprocurement.gov.gr/kimds2/unprotected/searchRequests.htm" target="_blank">http://www.eprocurement.gov.gr/kimds2/unprotected/searchRequests.htm</a>'
  '</p>';  

gks_big_text_project_reference_info_text=
  '<p><b>Η αναγνώριση του αγαθού/ υπηρεσίας/ μελέτης/ έργου (Project Reference) στο οποίο παραπέμπει το τιμολόγιο</b></p>' +
  '<p>Πεδίο ΔΡΟΜΟΛΟΓΗΣΗΣ. Το πεδίο χρησιμοποιείται ως <b>Αναγνωριστικό ' +
  'Σύμβασης</b> για τον τύπο του Προϋπολογισμού και λαμβάνει τις τιμές : ' +
  '<b>«1|ΑΔΑ Ανάληψης»</b> όταν αφορά τον <b>Τακτικό Προϋπολογισμό</b> ' +
  '<b>«2| Κωδικοποιημένος Ενάριθμος»</b> όταν αφορά το <b>ΠΔΕ</b> ' +
  '<b>«3|ΑΔΑ Ανάληψης»</b> όταν αφορά <b>λοιπούς</b> προϋπολογισμούς. ' +
  'Ως ΑΔΑ Ανάληψης εννοείται <b>ΑΔΑ Ανάληψης Υποχρέωσης</b>. Οι κωδικοί ΑΔΑ ' +
  'και Ενάριθμος αναφέρονται στη Σύμβαση, ως πηγές χρηματοδότησης.' +
  '</p><p>' + 
  'Με βάση την τιμή που εισάγεται στο πεδίο BT-11, το ηλεκτρονικό τιμολόγιο ' +
  'δρομολογείται σε εκείνο το πληροφοριακό σύστημα μέσω του οποίου ' +
  'πραγματοποιείται η παραλαβή, εκκαθάριση και πληρωμή της σχετικής ' +
  'δαπάνης.' + 
  '</p><p>' + 
  'Το πεδίο BT-11 συμπληρώνεται ως εξής:' +  
  '</p>' + 
  '<ul>' +
    '<li><b>«1| ΑΔΑ Ανάληψης»</b> : (Αριθμός Διαδικτυακής Ανάρτησης) όταν η αναθέτουσα αρχή είναι φορέας της ' +
    '<b>Κεντρικής Διοίκησης</b> σύμφωνα με το άρθρο 14 του νόμου 4270/2014 (Α.143) και οι δαπάνες βαρύνουν τον ' +
    '<b>Τακτικό Προϋπολογισμό</b>. Δηλαδή καταχωρούνται : η ένδειξη «1», το διαχωριστικό «|» και ο Αριθμός ' +
    'Διαδικτυακής Ανάρτησης (ΑΔΑ) της σχετικής απόφασης δέσμευσης πίστωσης. Το Η.Τ δρομολογείται για το ' +
    '<b>ΟΠΣΔΠ</b>. Αφορά φορείς της Κεντρικής Διοίκησης.</li>' +
    '<li><b>«2| ο κωδικοποιημένος Ενάριθμος»</b> όταν ο φορέας ανήκει στους λοιπούς Φορείς Γενικής Κυβέρνησης ' +
    'ή/και οι δαπάνες βαρύνουν αποκλειστικά τον <b>Προϋπολογισμό Δημοσίων Επενδύσεων (ΠΔΕ)</b>, δηλαδή ' +
    'καταχωρούνται : η ένδειξη «2», το διαχωριστικό «|» και ο Ενάριθμος του έργου ‘όπως αναφέρεται στην ' +
    'σχετική ΣΑ και μνημονεύεται υποχρεωτικά στο κείμενο της σύμβασης (βλέπε παρ.2 του άρθρου 3 της αριθ. ' +
    '63446/31-5-2021 υ.α) . Το Η.Τ δρομολογείται για το <b>ePDE</b>. Αφορά φορείς της Κεντρικής Διοίκησης.</li>' +
    '<li><b>«3|ΑΔΑ Ανάληψης»</b> όταν οι δαπάνες δεν βαρύνουν τους ανωτέρω προϋπολογισμούς, αλλά η σύμβαση ' +
    'βαρύνει τον <b>προϋπολογισμό του συγκεκριμένου φορέα</b>= στη περίπτωση σύμβασης με Φορέα που ανήκει ' +
    'στους λοιπούς φορείς της <b>Γενικής Κυβέρνησης</b>, αλλά και σε ορισμένες περιπτώσεις φορείς της <b>Κεντρικής ' +
    'Διοίκησης</b> π.χ. Δήμος, ΝΠΔΔ (παρ.1 του άρθρου 14 του ν.4270/14). Καταχωρούνται : η ένδειξη «3», το ' +
    'διαχωριστικό «|» και ο Αριθμός Διαδικτυακής Ανάρτησης της σχετικής απόφασης δέσμευσης πίστωσης . Το ' +
    'Η.Τ δρομολογείται για τα πληροφοριακά συστήματα (ERPs) των Α.Α και δεν αφορά φορείς της Κεντρικής ' +
    'Διοίκησης.</li>' +
  '</ul>' +
  
  '<p><b>Στη περίπτωση Πιστωτικού Τιμολογίου το πεδίο ΒΤ-11 δεν υφίσταται</b>. Εάν όμως το πιστωτικό Η.Τ συσχετίζεται με ' +
  'παλαιότερο χρεωστικό Η.Τ με την ίδια σύμβαση, χρησιμοποιείται από το ΚΕ.Δ ως πληροφορία δρομολόγησης το ' +
  'αντίστοιχο πεδίο παλαιότερου χρεωστικού συσχετιζόμενου Η.Τ (βλέπε περιγραφή για το BT-25), Μόνο ένα Στοιχείο ' +
  'Αναφοράς Αγαθού/Υπηρεσίας/Μελέτης/Έργου επιτρέπεται σε επίπεδο παραστατικού.' +
  '</p><p>'+
  'Ο <b>ΑΔΑ</b> είναι ο μοναδικός κωδικός αριθμός που λαμβάνει το <b>έγγραφο της Απόφασης Ανάληψης Υποχρέωσης ' +
  '(ΑΑΥ)</b> όταν αναρτηθεί στο σύστημα του <b>ΔΙΑΥΓΕΙΑ</b>. Ο ΑΔΑ αναφέρεται στο έγγραφο της Σύμβασης. Η ΑΑΥ είναι η ' +
  'Απόφαση που εκδίδεται από το Διατάκτη της Αναθέτουσας, βάσει της οποίας πραγματοποιείται η <b>δέσμευση ' +
  'πίστωσης</b> και γίνεται η σχετική ανάληψη υποχρέωσης σε συγκεκριμένη κατηγορία δαπάνης του εγκεκριμένου ' +
  'προϋπολογισμού του έργου, πριν την υλοποίηση της δαπάνης. Για πολυετείς δαπάνες υπάρχει παραπάνω από μια ' +
  'ΑΑΥ. Σε αυτή την περίπτωση αν δεν αναφέρεται η ΑΑΥ στο έγγραφο της σύμβασης χρειάζεται να επικοινωνήσετε με ' +
  'την υπηρεσία της Αναθέτουσας Αρχής που εκτελεί τη σύμβαση. ' +
  '</p><p>'+
  '<b>Ενάριθμος</b> είναι δεκατετραψήφιος κωδικός μοναδικής αναγνώρισης των <b>έργων του ΠΔΕ</b>, ο οποίος παράγεται από ' +
  'το Ολοκληρωμένο Πληροφοριακό Σύστημα της Διεύθυνσης Δημοσίων Επενδύσεων του Υπουργείου Ανάπτυξης και ' +
  'Επενδύσεων (<b>e-ΠΔΕ</b>). Τα πρώτα τέσσερα ψηφία αποτελούν το έτος πρώτης ένταξης του έργου στο ΠΔΕ, τα επόμενα ' +
  'τον κωδικό της Συλλογικής Απόφασης (ΣΑ), στην οποία είναι ενταγμένο και τα υπόλοιπα τον αύξοντα αριθμό του ' +
  'έργου. Ο Ενάριθμος χαρακτηρίζει μοναδικά ένα έργο ή μελέτη. Στη Σύμβαση με το Ελληνικό Δημόσιο αναφέρεται ' +
  'πάντα η πηγή χρηματοδότησης (ΠΔΕ ή/και ενάριθμος). Σε περίπτωση που δεν καταστεί εφικτή η ανεύρεση του ' +
  'ενάριθμου του έργου, θα πρέπει ο δικαιούχος να απευθύνεται στην αρμόδια Αναθέτουσα Αρχή (ΑΑ).</p>';


gks_big_text_b2g_inv_buyer_name_info_text=
  '<p><b>Η πλήρης ονομασία του Αγοραστή</b></p>' +
  '<p>Πεδίο ΔΡΟΜΟΛΟΓΗΣΗΣ. Για το Ελληνικό Δημόσιο, η <b>υπερκείμενη</b> ' +
  'διοικητική δομή <b>ΑΓΟΡΑΣΤΗΣ</b> (π.χ ΑΝΕΞΑΡΤΗΤΗ ΑΡΧΗ ΔΗΜΟΣΙΩΝ ' +
  'ΕΣΟΔΩΝ -ΑΑΔΕ-, Υπουργείο Ψηφ. Διακυβέρνησης, Νοσοκομείο ' +
  'ΕΥΑΓΓΕΛΙΣΜΟΣ, ΥΠΟΥΡΓΕΙΟ ΕΘΝΙΚΗΣ ΑΜΥΝΗΣ, ΥΠΟΥΡΓΕΙΟ ' +
  'ΠΡΟΣΤΑΣΙΑΣ ΤΟΥ ΠΟΛΙΤΗ κ.λ.π) η γενικότερα Φορέας, του άρθρου ' +
  '14 του ν.4270/2014 ή οποιαδήποτε νομική οντότητα που εν ' +
  'προκειμένω εκτελεί δημόσια σύμβαση ) που πραγματοποιεί τη ' +
  'δαπάνη. Είναι οπωσδήποτε ο κάτοχος του <b>ΑΦΜ</b>.' +
  '</p><p>' + 
  'Αγοραστής δύναται να είναι μια υπερκείμενη κρατική δομή με ' +
  'ΑΦΜ, η οποία δύναται να έχει μια έως πολλές αναθέτουσες αρχές ' +
  'Α.Α υπαγόμενες σε αυτή (χωρίς δικό τους ΑΦΜ), οι οποίες όμως ' +
  'πραγματοποιούν δαπάνες. Σε αυτή τη περίπτωση, η Α.Α στα πεδία ' +
  'ΒΤ-10, ΒΤ-46 που πραγματοποιεί την δαπάνη και πληρώνει το Η.Τ ' +
  'κληρονομεί το <b>ΑΦΜ Αγοραστή</b> και υπάγεται στον Αγοραστή/Φορέα ' +
  'του πεδίου BT-44.' +
  '</p><p>' + 
  'Αγοραστής δύναται επίσης να είναι και μια Α.Α (π.χ Παν/μιο ' +
  'Αιγαίου, Νοσοκομείο ΕΥΑΓΓΕΛΙΣΜΟΣ) στο ρόλο του ' +
  'Αγοραστή/Φορέα, εφόσον η Α.Α είναι η ιδία κάτοχος ΑΦΜ. Σε αυτή ' +
  'τη περίπτωση οι τιμές στα πεδία BT-10 και BT-44 είναι ταυτόσημες, ' +
  'και ως εκ τούτου το πεδίο BT-10 ως μη υποχρεωτικό δύναται να ' +
  'παραληφθεί ως περιττό από το XML του Η.Τ (εκτός κι αν το BT-10 ' +
  'φέρει συμπληρωματική πληροφορία, βλέπε περιγραφή πεδίου ΒΤ-10)</p>';

gks_big_text_b2g_inv_aaht_code_info_text=
  '<p><b>Κωδικός – αναγνωριστικό Αναθέτουσας Αρχής / Αναθέτοντος Φορέα</b></p>' +
  '<p>Πεδίο ΔΡΟΜΟΛΟΓΗΣΗΣ. Ο <b>Κωδικός (Label) Αναθέτουσας Αρχής / ' +
  'Αναθέτοντος Φορέα</b> για το Ελληνικό Δημόσιο, είναι η από το νόμο ' +
  'ορισθείσα Αναθέτουσα Αρχή (Α.Α) που λαμβάνει και διαχειρίζεται το ' +
  'Η.Τ, όπως αυτός προσδιορίζεται στο <b>«ΜΗΤΡΩΟ ΑΝΑΘΕΤΟΥΣΩΝ ' +
  'ΑΡΧΩΝ» ΑΑΗΤ</b> για την ηλεκτρονική τιμολόγηση της ΓΓΠΣ ΔΔ, με το ' +
  'πεδίο <b>«ΚΩΔΙΚΟΣ ΑΝΑΘΕΤΟΥΣΑΣ»</b> (π.χ 2048.8010430600.00061) ' +
  'στην ιστοσελίδα του επίσημου ιστότοπου της ΓΓΠΣ ΔΔ ' +
  '<a href="https://www.gsis.gr/e-Invoice" target="_blank">www.gsis.gr/e-Invoice</a>.' +
  '</p><p>' + 
  'Αφορά μια αυτοτελή διοικητική δομή/μονάδα, ( όπως Υπουργείο ' +
  'Ψηφ. Διακυβέρνησης, ΔΟΥ Ιωαννίνων, Πανεπιστήμιο Αιγαίου) του ' +
  'Αγοραστή (όπως αυτός περιγράφεται στο πεδίο BT-44), η οποία ' +
  'όμως υπάγεται στον Αγοραστή (ΒΤ-44) ή μπορεί να είναι ή ίδια ' +
  'Αγοραστής, με δικό της ή κληρονομούμενο ΑΦΜ., π.χ ΔΙΕΥΘΥΝΣΗ ' +
  'ΑΣΤΥΝΟΜΙΑΣ ΟΡΕΣΤΙΑΔΑΣ. Εάν η Α.Α έχει δικό της ΑΦΜ είναι ' +
  'ταυτόχρονα και Αγοραστής (ΒΤ-44), διαφορετικά ο Αγοραστής είναι ' +
  'η υπερκείμενη δομή/φορέας από τον οποίο η Α.Α κληρονομεί το ' +
  'ΑΦΜ (π.χ ΥΠΟΥΡΓΕΙΟ ΠΡΟΣΤΑΣΙΑΣ ΤΟΥ ΠΟΛΙΤΗ).</p>';
        