/* 
Κώστας Γουτούδης
gks ERP
www.gks.gr
*/

document.getElementById('gks_2fa_text1').innerHTML =
'<p>To 2FA σημαίνει <b>Two-factor authentication</b> ή <b>Έλεγχος ταυτότητας δύο παραγόντων</b></p>'+
'<p>Δηλαδή, όταν είναι να συνδεθούμε στο site θα βάζουμε το όνομα χρήστη και τον κωδικό πρόσβασης όπως ήδη κάνουμε μέχρι τώρα.  Με το 2FA θα μας ζητηθεί ένας επιπλέον κωδικός στο επόμενο βήμα. Αυτό τον επιπλέον κωδικό θα το βλέπουμε από το κινητό μας. Κάθε φορά αυτός ο κωδικός θα είναι διαφορετικός.</p>'+
'<p>Άρα για να συνδεθούμε θέλουμε και το κινητό μας οπότε και να κλέψει ή να μαντέψει κάποιος τον κωδικό μας, θα πρέπει να έχει και το κινητό μας.</p>'+
'<p>Η εφαρμογή που θα μας δίνει αυτόν τον επιπλέον κωδικό, για Android:</p>';

document.getElementById('gks_2fa_text2').innerHTML ='<p>για iPhone:</p>';

document.getElementById('gks_2fa_text3').innerHTML =
'<p>Η διαδικασία για την ενεργοποίηση είναι η εξής:</p>'+
'<p>Συνδεόμαστε στο site και μεταβαίνουμε στην παρακάτω σελίδα:</p>';

document.getElementById('gks_2fa_text4').innerHTML =
'<p>Και θα εμφανιστεί η σελίδα:</p>';

document.getElementById('gks_2fa_text5').innerHTML =
'<p>Στο κινητό ανοίγουμε την εφαρμογή <b>Επαληθευτής Google</b> (<b>Google Authenticator</b>) και κάτω δεξιά έχει ένα κουμπί με το (+) για προσθήκη λογαριασμού.</p>';

document.getElementById('gks_2fa_text6').innerHTML =
'<p>Σαρώνουμε το QR Code και προσθέτουμε τον λογαριασμό.</p>'+
'<p>Ο νέος λογαριασμός θα έχει όνομα <b>Wordfence (' + window.location.host +')</b></p>'+
'<p>Εάν κάνετε την διαδικασία από κινητό και άρα δεν μπορείτε να σαρώσετε το QR Code, μπορείτε να προσθέσετε τον λογαριασμό ως εξής.<br>'+
'Επιλέγετε και αντιγράφετε τον κωδικό-κλειδί:</p>';

document.getElementById('gks_2fa_text7').innerHTML =
'<p>Στην εφαρμογή <b>Επαληθευτής Google</b> (<b>Google Authenticator</b>) και κάτω δεξιά έχει ένα κουμπί με το (+) για προσθήκη λογαριασμού και επιλέγουμε το <b>Εισαγάγετε ένα κλειδί ρύθμισης</b>.<br>'+
'Στο πεδίο <b>Όνομα λογαριασμού</b> πληκτρολογούμε ένα όνομα π.χ. το <b>' + window.location.host +'</b>.<br>'+
'Στο πεδίο <b>Το κλειδί σας</b> κάνουμε επικόλληση τον παραπάνω κωδικό.<br>'+
'Στο πεδίο <b>Τύπος κλειδιού</b> αφήνουμε επιλεγμένο το <b>Βάσει χρόνου</b>.<br>'+
'Κάνουμε κλικ στο κουμπί προσθήκη.</p>';

document.getElementById('gks_2fa_text8').innerHTML =
'<p>Εφόσον ο λογαριασμός έχει προστεθεί επιτυχώς στην εφαρμογή <b>Επαληθευτής Google</b>, θα μας εμφανίσει ένα 6ψήφιο κωδικό, ο οποίος αλλάζει κάθε 10 δευτερόλεπτα.</p>'+
'<p>Στην σελίδα:</p>';

document.getElementById('gks_2fa_text9').innerHTML =
'<p>Καταχωρούμε τον 6ψήφιο που βλέπουμε εκείνη την στιγμή στο κινητό μας στο αντίστοιχο πλαίσιο κειμένου και κάνουμε κλικ στο κουμπί <b>ACIVATE</b></p>'+
'<p>Εφόσον γίνει σωστά θα μας προτείνει να κατεβάσουμε (download) κάποιους κωδικούς ανάκτησης. Επιλέξτε το <b>SKIP</b> (παράβλεψη).</p>';

document.getElementById('gks_2fa_text10').innerHTML =
'<p>Η σελίδα που θα δείτε είναι η παρακάτω:</p>';


document.getElementById('gks_2fa_text11').innerHTML =
'<p>Που σημαίνει ότι η ενεργοποίηση έγινε επιτυχώς.<br>'+
'Για να μεταβούμε στο γνωστό μας διαχειριστικό περιβάλλον κάνουμε κλικ στο <b>gks System</b></p>';

document.getElementById('gks_2fa_text12').innerHTML =
'<p>Όταν χρειαστεί να ξανασυνδεθούμε στο site, αφού εισάγουμε τα στοιχεία σύνδεσης και πατήσουμε το κουμπί <b>Σύνδεση</b>:</p>';

document.getElementById('gks_2fa_text13').innerHTML =
'<p>Στο επόμενο βήμα θα μας ζητηθεί ο επιπλέον κωδικός:</p>';

document.getElementById('gks_2fa_text14').innerHTML =
'<p>Οπότε μεταβαίνουμε στο κινητό μας, στην εφαρμογή <b>Επαληθευτής Google</b> (<b>Google Authenticator</b>) και βλέπουμε τον 6ψήφιο κωδικό που έχει για το <b>Wordfence (' + window.location.host +')</b> εκείνη την στιγμή.<br>(Εάν το κρατήσουμε πατημένο κάνει αντιγραφή του 6ψήφιου).</p>'+
'<p>Οπότε τον καταχωρούμε στην παραπάνω σελίδα και κάνουμε κλικ στο <b>Log in</b>.<br>Καλό είναι να ενεργοποιήσετε το <b>Remember for 30 days</b> έτσι ώστε για τις επόμενες 30 ημέρες να μην σας ζητηθεί επιπλέον κωδικός για αυτήν την συσκευή, εφόσον συνδέεστε από κάποια προσωπική σας συσκευή π.χ. κινητό ή το προσωπικό σας laptop.</p>'+
'<p>Εάν αγοράσουμε νέο κινητό θα πρέπει ή να μεταφέρουμε τα δεδομένα του <b>Επαληθευτής Google</b> (<b>Google Authenticator</b>) με κάποιον τρόπο στο νέο κινητό, ή να απενεργοποιήσουμε το 2FA στο site και το ξαναενεργοποιήσουμε για το νέο κινητό.</p>';
