/* 
Κώστας Γουτούδης
gks ERP
www.gks.gr
*/

document.getElementById('invoices_no_mark_text').innerHTML =
'Είναι τα παραστατικά που έχουν σταλεί στον πάροχο αλλά δεν έχουν σταλεί από τον πάροχο προς myData, πιθανόν  τα συστήματα του myData να έχουν κάποιο πρόβλημα.<br>'+
'H λίστα <b>Σε αναμονή από πάροχο προς ΑΑΔΕ</b> εμφανίζει τα παραστατικά που είναι σε ουρά αποστολής προς τον πάροχο.<br>'+
'Το κουπμί <b>Λήψη λίστας από πάροχο</b> λαμβάνει την λίστα των παραστατικών που είναι στην ουρά σε πραγματικό χρόνο.<br>'+
'Όταν σταλούν από τον πάροχο προς το myData θα πρέπει να μεταβείτε σε αυτά τα παραστατικά και να κάνετε <span class="paroxos_get_docstate"><i class="fas fa-sync"></i></span> <b> Λήψη κατάστασης από πάροχο</b> από το σχετικό κουμπί του κάθε παραστατικού.';


document.getElementById('invoices_tf1_text').innerHTML =
'Είναι τα παραστατικά που δεν έχουν σταλεί τον πάροχο, πιθανόν τα συστήματα του παρόχου να έχουν κάποιο πρόβλημα.<br>'+
'<b>Ωστόσο</b> έχει δημιουργηθεί ένα QR Code με σύνδεσμο στον πάροχο και μπορεί να χρησιμοποιηθεί στην εκτύπωση που θα πρέπει να δώσετε στον λήπτη.<br>'+
'O λήπτης θα μπορεί να δει τα βασικά στοιχεία αυτού του παραστατικού.<br>'+
'Εσείς από την πλευρά σας θα πρέπει να στείλετε το παραστατικό στον πάροχο εντός 24 ωρών, όταν αποκατασταθεί η επικοινωνία του gks ERP με τον πάροχο.<br>'+
'Για να είναι δυνατή η δημιουργία αυτού του QR Code θα πρέπει να υπάρχει <b>ενεργό</b> <span class="tf1_local_ACTIVE">ACTIVE</span> κλειδί για κάθε ΑΦΜ.';

