<?php
/* 
Κώστας Γουτούδης
gks ERP
www.gks.gr
*/
//date, time ...

if (isset($gks_lang_array['part3'])==false) 

  $gks_lang_array['part3']=array(
'Δε'=>'Mo',
'Τρ'=>'Tu',
'Τε'=>'We',
'Πε'=>'Th',
'Πα'=>'Fr',
'Σα'=>'Sa',
'Κυ'=>'Su',

'Δευ'=>'Mon',
'Τρι'=>'Tue',
'Τετ'=>'Wed',
'Πεμ'=>'Thu',
'Παρ'=>'Fri',
'Σαβ'=>'Sat',
'Κυρ'=>'Sun',


'Δευτέρα'=>'Monday',
'Τρίτη'=>'Tuesday',
'Τετάρτη'=>'Wednesday',
'Πέμπτη'=>'Thursday',
'Παρασκευή'=>'Friday',
'Σάββατο'=>'Saturday',
'Κυριακή'=>'Sunday',

'Ιανουάριος'=>'January',
'Φεβρουάριος'=>'February',
'Μάρτιος'=>'March',
'Απρίλιος'=>'April',
'Μάιος'=>'May',
'Ιούνιος'=>'June',
'Ιούλιος'=>'July',
'Αύγουστος'=>'August',
'Σεπτέμβριος'=>'September',
'Οκτώβριος'=>'October',
'Νοέμβριος'=>'November',
'Δεκέμβριος'=>'December',

'Έτος'=>'Year',
'Μήνας'=>'Month',
'Ημέρα'=>'Day',
'Ώρα'=>'Hour',
'Λεπτά'=>'Minutes',

'1η'=>'1st',
'2η'=>'2nd',
'3η'=>'3rd',
'4η'=>'4th',
'5η'=>'5th',
'6η'=>'6th',
'7η'=>'7th',
'8η'=>'8th',
'9η'=>'9th',
'10η'=>'10th',
'11η'=>'11th',
'12η'=>'12th',
'η'=>'th',

'1ου'=>'1st',
'2ου'=>'2nd',
'3ου'=>'3rd',
'4ου'=>'4th',
'5ου'=>'5th',
'6ου'=>'6th',
'7ου'=>'7th',
'8ου'=>'8th',
'9ου'=>'9th',
'10ου'=>'10th',
'11ου'=>'11th',
'12ου'=>'12th',
'ου'=>'th',


);

